-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/cxy/Desktop/2026project/pretest/pretest-stata/tests/qa_roun
> d18b_delta_verification.log
  log type:  text
 opened on:  21 Dec 2025, 20:40:29

. 
. * Set up paths
. local base_path "/Users/cxy/Desktop/2026project/pretest/pretest-stata"

. adopath + "`base_path'"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Applications/Stata/personal/"
  [5]  (PLUS)      "/Applications/Stata/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/cxy/Desktop/2026project/pretest/pretest-stata"

. adopath + "`base_path'/ado"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Applications/Stata/personal/"
  [5]  (PLUS)      "/Applications/Stata/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/cxy/Desktop/2026project/pretest/pretest-stata"
  [8]              "/Users/cxy/Desktop/2026project/pretest/pretest-stata/ado"

. capture do "`base_path'/_pretest_mata.do"

. 
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "  DEEP VERIFICATION: delta_bar Definition"
  DEEP VERIFICATION: delta_bar Definition

. di as text "=============================================================="
==============================================================

. di as text ""


. 
. *****************************************************************************
> ***
. * Create simple data with KNOWN treatment effect
. *****************************************************************************
> ***
. clear

. set seed 12345

. 
. * Parameters
. local n_treat = 100

. local n_ctrl = 100

. local T = 5

. local t0 = 4

. local true_tau = 2.5  // True treatment effect

. 
. * Generate data
. set obs `=(`n_treat' + `n_ctrl') * `T''
Number of observations (_N) was 0, now 1,000.

. gen id = ceil(_n / `T')

. bysort id: gen t = _n

. gen D = (id <= `n_treat')

. 
. * Generate Y: no pre-treatment violation, pure treatment effect
. * Y = 10 + 0.5*t + tau*D*I(t>=t0) + epsilon
. gen Y = 10 + 0.5 * t + `true_tau' * D * (t >= `t0') + rnormal(0, 0.2)

. 
. xtset id t

Panel variable: id (strongly balanced)
 Time variable: t, 1 to 5
         Delta: 1 unit

. 
. di as text ""


. di as text "Data Description:"
Data Description:

. di as text "  n_treat = `n_treat', n_ctrl = `n_ctrl'"
  n_treat = 100, n_ctrl = 100

. di as text "  T = `T', t0 = `t0'"
  T = 5, t0 = 4

. di as text "  T_pre = " `t0' - 1
  T_pre = 3

. di as text "  T_post = " `T' - `t0' + 1
  T_post = 2

. di as text "  True treatment effect (tau) = `true_tau'"
  True treatment effect (tau) = 2.5

. di as text ""


. 
. *****************************************************************************
> ***
. * Manual calculation of delta_t
. *****************************************************************************
> ***
. di as text "=============================================================="
==============================================================

. di as text "Manual Calculation of delta_t"
Manual Calculation of delta_t

. di as text "=============================================================="
==============================================================

. di as text ""


. di as text "Formula: delta_t = (Y_bar_{t,D=1} - Y_bar_{t0,D=1}) - (Y_bar_{t,D
> =0} - Y_bar_{t0,D=0})"
Formula: delta_t = (Y_bar_{t,D=1} - Y_bar_{t0,D=1}) - (Y_bar_{t,D=0} - Y_bar_{t
> 0,D=0})

. di as text ""


. 
. * Get mean at t0 for both groups
. qui sum Y if D == 1 & t == `t0'

. local Y_t0_D1 = r(mean)

. qui sum Y if D == 0 & t == `t0'

. local Y_t0_D0 = r(mean)

. 
. di as text "Reference point (t0 = `t0'):"
Reference point (t0 = 4):

. di as text "  Y_bar_{t0, D=1} = " %9.4f `Y_t0_D1'
  Y_bar_{t0, D=1} =   14.4914

. di as text "  Y_bar_{t0, D=0} = " %9.4f `Y_t0_D0'
  Y_bar_{t0, D=0} =   12.0059

. di as text ""


. 
. * Calculate delta_t for each post-treatment period
. local T_post = `T' - `t0' + 1

. local sum_delta = 0

. 
. di as text "Post-treatment periods (t = t0, ..., T):"
Post-treatment periods (t = t0, ..., T):

. forvalues time = `t0'/`T' {
  2.     qui sum Y if D == 1 & t == `time'
  3.     local Y_t_D1 = r(mean)
  4.     qui sum Y if D == 0 & t == `time'
  5.     local Y_t_D0 = r(mean)
  6.     
.     * delta_t = (Y_t_D1 - Y_t0_D1) - (Y_t_D0 - Y_t0_D0)
.     local delta_`time' = (`Y_t_D1' - `Y_t0_D1') - (`Y_t_D0' - `Y_t0_D0')
  7.     local sum_delta = `sum_delta' + `delta_`time''
  8.     
.     di as text "  t = `time': delta_`time' = " %9.4f `delta_`time'' " = (" %9
> .4f `Y_t_D1' " - " %9.4f `Y_t0_D1' ") - (" %9.4f `Y_t_D0' " - " %9.4f `Y_t0_D
> 0' ")"
  9. }
  t = 4: delta_4 =    0.0000 = (  14.4914 -   14.4914) - (  12.0059 -   12.0059
> )
  t = 5: delta_5 =    0.0654 = (  15.0094 -   14.4914) - (  12.4585 -   12.0059
> )

. 
. * Calculate delta_bar
. local manual_delta_bar = `sum_delta' / `T_post'

. 
. di as text ""


. di as text "Manual delta_bar = (1/T_post) * sum(delta_t)"
Manual delta_bar = (1/T_post) * sum(delta_t)

. di as text "                 = (1/`T_post') * " %9.4f `sum_delta'
                 = (1/2) *    0.0654

. di as text "                 = " %9.4f `manual_delta_bar'
                 =    0.0327

. di as text ""


. 
. *****************************************************************************
> ***
. * Run pretest and compare
. *****************************************************************************
> ***
. di as text "=============================================================="
==============================================================

. di as text "Package Calculation"
Package Calculation

. di as text "=============================================================="
==============================================================

. 
. pretest Y, treatment(D) time(t) threshold(1) treat_time(`t0') nograph

Data Validation Summary:
  Total observations:            1,000
  Valid observations:            1,000
  Treated observations:            500
  Control observations:            500
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 5
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 2
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          1.000       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      5           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):2
   Sample size (n):        1,000

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.0124
   Kappa (κ):              1.581
   Critical value f(α,Σ̂): 4.417

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.033
   Conditional CI (95%):   [-0.127, 0.192]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
command _pretest_format_number is unrecognized
r(199);

end of do-file
r(199);
