-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/cxy/Desktop/2026project/pretest/pretest-stata/tests/qa_roun
> d18_real_data.log
  log type:  text
 opened on:  21 Dec 2025, 20:38:34

. 
. * Set up paths (absolute paths as required)
. local base_path "/Users/cxy/Desktop/2026project/pretest/pretest-stata"

. adopath + "`base_path'"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Applications/Stata/personal/"
  [5]  (PLUS)      "/Applications/Stata/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/cxy/Desktop/2026project/pretest/pretest-stata"

. adopath + "`base_path'/ado"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Applications/Stata/personal/"
  [5]  (PLUS)      "/Applications/Stata/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/cxy/Desktop/2026project/pretest/pretest-stata"
  [8]              "/Users/cxy/Desktop/2026project/pretest/pretest-stata/ado"

. 
. * Load Mata functions
. capture do "`base_path'/_pretest_mata.do"

. 
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "  QUALITY ASSURANCE TEST - ROUND 18"
  QUALITY ASSURANCE TEST - ROUND 18

. di as text "  Real Data Testing with Reasonableness Verification"
  Real Data Testing with Reasonableness Verification

. di as text "=============================================================="
==============================================================

. di as text ""


. 
. * Initialize test counters
. local n_tests = 0

. local n_pass = 0

. local n_fail = 0

. local n_warning = 0

. 
. *****************************************************************************
> ***
. * TEST 1: Stata Built-in nlswork Data (REAL DATA)
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 1: Stata nlswork Data (Union Wage Premium) - REAL DATA"
TEST 1: Stata nlswork Data (Union Wage Premium) - REAL DATA

. di as text "=============================================================="
==============================================================

. 
. * Load nlswork data
. webuse nlswork, clear
(National Longitudinal Survey of Young Women, 14-24 years old in 1968)

. 
. * Data description
. di as text ""


. di as text "nlswork data: National Longitudinal Survey of Young Women (1968-1
> 988)"
nlswork data: National Longitudinal Survey of Young Women (1968-1988)

. di as text "Outcome: ln_wage (log hourly wage)"
Outcome: ln_wage (log hourly wage)

. di as text "Treatment: union membership (as quasi-treatment)"
Treatment: union membership (as quasi-treatment)

. 
. * Keep complete cases for key variables
. keep if !missing(ln_wage, union, year, idcode)
(9,296 observations deleted)

. 
. * Create continuous time index (year has gaps)
. egen time = group(year)

. xtset idcode time

Panel variable: idcode (unbalanced)
 Time variable: time, 1 to 12, but with gaps
         Delta: 1 unit

. 
. * Summary
. di as text ""


. di as text "Data Summary:"
Data Summary:

. tabstat ln_wage, by(time) stat(n mean sd)

Summary for variables: ln_wage
Group variable: time (group(year))

    time |         N      Mean        SD
---------+------------------------------
       1 |       798  1.615356  .3891465
       2 |       928  1.658524  .3847313
       3 |      1244  1.659112  .3917438
       4 |      1055  1.675512  .3926039
       5 |      2160  1.658796  .4308145
       6 |      1351  1.782643  .4060574
       7 |      1686  1.740162  .4377009
       8 |      2083  1.726588   .468051
       9 |      1805  1.779235  .4887372
      10 |      2079   1.83258  .5056269
      11 |      2161  1.842121  .5201065
      12 |      1888  1.892728   .524404
---------+------------------------------
   Total |     19238  1.754718  .4678082
----------------------------------------

. tab union time if time <= 5

           |                      group(year)
1 if union |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |       620        701        984        817      1,760 |     4,882 
         1 |       178        227        260        238        400 |     1,303 
-----------+-------------------------------------------------------+----------
     Total |       798        928      1,244      1,055      2,160 |     6,185 

. 
. * Test with treat_time = 6
. local ++n_tests

. di as text ""


. di as text "Testing with treat_time = 6..."
Testing with treat_time = 6...

. 
. capture noisily pretest ln_wage, treatment(union) time(time) threshold(0.5) t
> reat_time(6) nograph

Data Validation Summary:
  Total observations:           19,238
  Valid observations:           19,238
  Treated observations:          4,510
  Control observations:         14,728
Panel data detected: panelvar=idcode, timevar=time

Time Structure:
  T (total periods)     = 12
  t0 (treatment time)   = 6
  T_pre (pre-treatment) = 5
  T_post (post-treatment) = 7
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      12          Treat time (t₀):        6
   Pre-treatment (T_pre):  5           Post-treatment (T_post):7
   Sample size (n):        19,238

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.0427
   Kappa (κ):              4.472
   Critical value f(α,Σ̂): 39.170

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               -0.011
   Conditional CI (95%):   [-0.485, 0.462]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [-0.055, 0.033]  (assuming parallel trends)

. 
. if _rc == 0 {
.     local s_pre = e(S_pre)
.     local kappa = e(kappa)
.     local delta = e(delta_bar)
.     local ci_lo = e(ci_lower)
.     local ci_hi = e(ci_upper)
.     local ci_width = `ci_hi' - `ci_lo'
.     local pretest_pass = e(pretest_pass)
.     
.     di as text ""

.     di as text "Results:"
Results:
.     di as text "  S_pre = " %9.4f `s_pre'
  S_pre =    0.0427
.     di as text "  kappa = " %9.4f `kappa'
  kappa =    4.4721
.     di as text "  delta_bar (ATT estimate) = " %9.4f `delta'
  delta_bar (ATT estimate) =   -0.0112
.     di as text "  CI = [" %9.4f `ci_lo' ", " %9.4f `ci_hi' "]"
  CI = [  -0.4847,    0.4623]
.     di as text "  CI width = " %9.4f `ci_width'
  CI width =    0.9470
.     di as text "  Pretest pass = " `pretest_pass'
  Pretest pass = 1
.     
.     * Reasonableness checks for log wage
.     * Union wage premium typically 10-20% (0.1-0.2 in log terms)
.     local reasonable = 1
.     
.     di as text ""

.     di as text "Reasonableness Assessment:"
Reasonableness Assessment:
.     
.     if `s_pre' > 1 {
.         di as error "  [?] S_pre = " %9.4f `s_pre' " seems high for wage data
> "
.         local reasonable = 0
.     }
.     else {
.         di as text "  [OK] S_pre magnitude is plausible"
  [OK] S_pre magnitude is plausible
.     }
.     
.     if abs(`delta') > 1 {
.         di as error "  [?] delta_bar > 1 seems unreasonable for log wage"
.         local reasonable = 0
.     }
.     else {
.         di as text "  [OK] delta_bar magnitude is plausible for log wage"
  [OK] delta_bar magnitude is plausible for log wage
.     }
.     
.     if `ci_width' > 5 {
.         di as error "  [?] CI width > 5 seems too wide"
.         local reasonable = 0
.     }
.     else {
.         di as text "  [OK] CI width is reasonable"
  [OK] CI width is reasonable
.     }
.     
.     if `reasonable' == 1 {
.         di as result "  [PASS] All results appear reasonable"
  [PASS] All results appear reasonable
.         local ++n_pass
.     }
.     else {
.         di as text "  [WARNING] Some results need investigation"
.         local ++n_warning
.     }
. }

. else {
.     di as error "  [FAIL] Command failed with error " _rc
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * TEST 2: Mathematical Formula Verification
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 2: Mathematical Formula Verification"
TEST 2: Mathematical Formula Verification

. di as text "=============================================================="
==============================================================

. 
. * Create synthetic data with KNOWN parameters
. clear

. set seed 54321

. local n_units = 200

. local T_total = 6

. local t0 = 4

. 
. * Known violation pattern: nu_t = 0.05 for all t
. local true_nu = 0.05

. 
. set obs `=`n_units' * `T_total''
Number of observations (_N) was 0, now 1,200.

. gen id = ceil(_n / `T_total')

. bysort id: gen t = _n

. gen D = (id <= `n_units'/2)

. 
. * Generate Y with known structure
. gen Y = 10 + 0.5 * t + rnormal(0, 0.5)

. 
. * Add cumulative violation for treated group
. forvalues s = 2/`T_total' {
  2.     replace Y = Y + `true_nu' if D == 1 & t >= `s'
  3. }
(500 real changes made)
(400 real changes made)
(300 real changes made)
(200 real changes made)
(100 real changes made)

. 
. * Add treatment effect for post-treatment
. replace Y = Y + 2 if D == 1 & t >= `t0'
(300 real changes made)

. 
. xtset id t

Panel variable: id (strongly balanced)
 Time variable: t, 1 to 6
         Delta: 1 unit

. 
. * Manual calculation of nu_t
. di as text ""


. di as text "Manual calculation of iterative violations nu_t:"
Manual calculation of iterative violations nu_t:

. forvalues time = 2/`=`t0'-1' {
  2.     local prev_time = `time' - 1
  3.     
.     * Mean for treated
.     qui sum Y if D == 1 & t == `time'
  4.     local Y_t_D1 = r(mean)
  5.     qui sum Y if D == 1 & t == `prev_time'
  6.     local Y_tm1_D1 = r(mean)
  7.     
.     * Mean for control
.     qui sum Y if D == 0 & t == `time'
  8.     local Y_t_D0 = r(mean)
  9.     qui sum Y if D == 0 & t == `prev_time'
 10.     local Y_tm1_D0 = r(mean)
 11.     
.     * nu_t = (Y_t - Y_{t-1})_D=1 - (Y_t - Y_{t-1})_D=0
.     local nu_`time' = (`Y_t_D1' - `Y_tm1_D1') - (`Y_t_D0' - `Y_tm1_D0')
 12.     di as text "  nu_`time' = " %9.4f `nu_`time'' " (expected: ~" %9.4f `t
> rue_nu' ")"
 13. }
  nu_2 =    0.0074 (expected: ~   0.0500)
  nu_3 =    0.0172 (expected: ~   0.0500)

. 
. * Manual calculation of S_pre (p=2)
. local sum_nu_sq = 0

. local T_pre_minus_1 = `t0' - 2

. forvalues time = 2/`=`t0'-1' {
  2.     local sum_nu_sq = `sum_nu_sq' + (`nu_`time'')^2
  3. }

. local manual_S_pre = sqrt(`sum_nu_sq' / `T_pre_minus_1')

. di as text ""


. di as text "Manual S_pre (p=2) = " %9.4f `manual_S_pre'
Manual S_pre (p=2) =    0.0133

. 
. * Run pretest
. local ++n_tests

. di as text ""


. di as text "Running pretest..."
Running pretest...

. capture noisily pretest Y, treatment(D) time(t) threshold(0.5) treat_time(`t0
> ') p(2) nograph

Data Validation Summary:
  Total observations:            1,200
  Valid observations:            1,200
  Treated observations:            600
  Control observations:            600
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 6
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 3
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      6           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):3
   Sample size (n):        1,200

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.0133
   Kappa (κ):              2.160
   Critical value f(α,Σ̂): 15.574

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.054
   Conditional CI (95%):   [-0.425, 0.532]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [-0.059, 0.166]  (assuming parallel trends)

. 
. if _rc == 0 {
.     local pkg_S_pre = e(S_pre)
.     local pkg_kappa = e(kappa)
.     local pkg_delta = e(delta_bar)
.     
.     di as text ""

.     di as text "Comparison:"
Comparison:
.     di as text "  Manual S_pre  = " %9.6f `manual_S_pre'
  Manual S_pre  =  0.013257
.     di as text "  Package S_pre = " %9.6f `pkg_S_pre'
  Package S_pre =  0.013257
.     local diff_S = abs(`manual_S_pre' - `pkg_S_pre')
.     di as text "  Difference    = " %9.6f `diff_S'
  Difference    =  0.000000
.     
.     * Verify kappa formula
.     local T_post = `T_total' - `t0' + 1
.     local sum_sq = 0
.     forvalues s = 1/`T_post' {
  2.         local sum_sq = `sum_sq' + `s'^2
  3.     }
.     local manual_kappa = sqrt(`sum_sq' / `T_post')
.     di as text ""

.     di as text "Kappa verification (p=2, T_post=`T_post'):"
Kappa verification (p=2, T_post=3):
.     di as text "  Manual kappa  = " %9.6f `manual_kappa'
  Manual kappa  =  2.160247
.     di as text "  Package kappa = " %9.6f `pkg_kappa'
  Package kappa =  2.160247
.     local diff_kappa = abs(`manual_kappa' - `pkg_kappa')
.     di as text "  Difference    = " %9.6e `diff_kappa'
  Difference    =  0.00e+00
.     
.     if `diff_S' < 0.01 & `diff_kappa' < 1e-10 {
.         di as result "  [PASS] Mathematical formulas verified"
  [PASS] Mathematical formulas verified
.         local ++n_pass
.     }
.     else {
.         di as error "  [FAIL] Formula discrepancy detected"
.         local ++n_fail
.     }
. }

. else {
.     di as error "  [FAIL] Command failed"
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * TEST 3: T_post = 1 Boundary (BUG-001 verification)
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 3: Boundary Condition - T_post = 1 (BUG-001 verification)"
TEST 3: Boundary Condition - T_post = 1 (BUG-001 verification)

. di as text "=============================================================="
==============================================================

. 
. clear

. set seed 99999

. set obs 300
Number of observations (_N) was 0, now 300.

. gen id = ceil(_n/3)

. gen time = mod(_n-1, 3) + 1

. gen treat = (id <= 50)

. gen y = 10 + 0.5*time + rnormal(0, 1)

. replace y = y + 2 if treat == 1 & time >= 3
(50 real changes made)

. xtset id time

Panel variable: id (strongly balanced)
 Time variable: time, 1 to 3
         Delta: 1 unit

. 
. local ++n_tests

. di as text "Testing with T=3, t0=3 (T_post=1)..."
Testing with T=3, t0=3 (T_post=1)...

. 
. capture noisily pretest y, treatment(treat) time(time) threshold(0.5) treat_t
> ime(3) nograph

Data Validation Summary:
  Total observations:              300
  Valid observations:              300
  Treated observations:            150
  Control observations:            150
Panel data detected: panelvar=id, timevar=time

Time Structure:
  T (total periods)     = 3
  t0 (treatment time)   = 3
  T_pre (pre-treatment) = 2
  T_post (post-treatment) = 1
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      3           Treat time (t₀):        3
   Pre-treatment (T_pre):  2           Post-treatment (T_post):1
   Sample size (n):        300

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.1927
   Kappa (κ):              1.000
   Critical value f(α,Σ̂): 9.085

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.000
   Conditional CI (95%):   [-0.717, 0.717]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [-0.000, 0.000]  (assuming parallel trends)

. 
. if _rc == 0 {
.     local se_val = e(se_delta_bar)
.     local ci_conv_lo = e(ci_conv_lower)
.     local ci_conv_hi = e(ci_conv_upper)
.     local ci_conv_width = `ci_conv_hi' - `ci_conv_lo'
.     
.     di as text "  se_delta_bar = " %12.6e `se_val'
  se_delta_bar =  5.77350e-07
.     di as text "  Conventional CI width = " %12.6e `ci_conv_width'
  Conventional CI width =  2.26317e-06
.     
.     if `se_val' < 0.01 {
.         di as error "  [FAIL] BUG-001 CONFIRMED: se_delta_bar abnormally smal
> l"
  [FAIL] BUG-001 CONFIRMED: se_delta_bar abnormally small
.         local ++n_fail
.     }
.     else {
.         di as result "  [PASS] se_delta_bar appears reasonable"
.         local ++n_pass
.     }
. }

. else {
.     di as error "  [FAIL] Command failed"
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * TEST 4: Cluster Standard Errors (BUG-008 verification)
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 4: Cluster Standard Errors (BUG-008 verification)"
TEST 4: Cluster Standard Errors (BUG-008 verification)

. di as text "=============================================================="
==============================================================

. 
. clear

. set seed 88888

. set obs 2500
Number of observations (_N) was 0, now 2,500.

. gen id = ceil(_n / 5)

. bysort id: gen t = _n

. gen D = (id <= 250)

. gen cluster_id = ceil(id / 10)

. gen Y = 10 + 0.5*t + 2*D + rnormal(0, 1)

. xtset id t

Panel variable: id (strongly balanced)
 Time variable: t, 1 to 5
         Delta: 1 unit

. 
. local ++n_tests

. 
. * Test without clustering
. di as text ""


. di as text "Without clustering:"
Without clustering:

. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.5) 
> nograph

Data Validation Summary:
  Total observations:            2,500
  Valid observations:            2,500
  Treated observations:          1,250
  Control observations:          1,250
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 5
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 2
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      5           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):2
   Sample size (n):        2,500

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.2368
   Kappa (κ):              1.581
   Critical value f(α,Σ̂): 21.677

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.033
   Conditional CI (95%):   [-0.775, 0.841]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [-0.091, 0.156]  (assuming parallel trends)

. if _rc == 0 {
.     local ci_width_no_cluster = e(ci_upper) - e(ci_lower)
.     local f_alpha_no_cluster = e(f_alpha)
.     local se_no_cluster = e(se_delta_bar)
.     di as text "  CI width = " %9.4f `ci_width_no_cluster'
  CI width =    1.6158
.     di as text "  f_alpha = " %9.4f `f_alpha_no_cluster'
  f_alpha =   21.6766
.     di as text "  se_delta_bar = " %9.4f `se_no_cluster'
  se_delta_bar =    0.0630
. }

. 
. * Test with clustering
. di as text ""


. di as text "With clustering:"
With clustering:

. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.5) 
> cluster(cluster_id) nograph

Data Validation Summary:
  Total observations:            2,500
  Valid observations:            2,500
  Treated observations:          1,250
  Control observations:          1,250
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 5
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 2
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      5           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):2
   Sample size (n):        2,500

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.2368
   Kappa (κ):              1.581
   Critical value f(α,Σ̂): 1208.872

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.033
   Conditional CI (95%):   [-24.519, 24.585]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [-5.965, 6.031]  (assuming parallel trends)

Warnings:
  - Wide confidence interval (width=49.1). Consider data quality.

. if _rc == 0 {
.     local ci_width_cluster = e(ci_upper) - e(ci_lower)
.     local f_alpha_cluster = e(f_alpha)
.     local se_cluster = e(se_delta_bar)
.     di as text "  CI width = " %9.4f `ci_width_cluster'
  CI width =   49.1036
.     di as text "  f_alpha = " %9.4f `f_alpha_cluster'
  f_alpha = 1208.8720
.     di as text "  se_delta_bar = " %9.4f `se_cluster'
  se_delta_bar =    3.0603
.     
.     local ci_ratio = `ci_width_cluster' / `ci_width_no_cluster'
.     local f_ratio = `f_alpha_cluster' / `f_alpha_no_cluster'
.     local se_ratio = `se_cluster' / `se_no_cluster'
.     
.     di as text ""

.     di as text "Ratios (cluster/no-cluster):"
Ratios (cluster/no-cluster):
.     di as text "  CI width ratio = " %9.2f `ci_ratio' "x"
  CI width ratio =     30.39x
.     di as text "  f_alpha ratio = " %9.2f `f_ratio' "x"
  f_alpha ratio =     55.77x
.     di as text "  se ratio = " %9.2f `se_ratio' "x"
  se ratio =     48.59x
.     
.     if `ci_ratio' > 10 {
.         di as error "  [FAIL] BUG-008 CONFIRMED: Cluster SE ratio = " %9.1f `
> ci_ratio' "x (abnormal)"
  [FAIL] BUG-008 CONFIRMED: Cluster SE ratio =      30.4x (abnormal)
.         local ++n_fail
.     }
.     else {
.         di as result "  [PASS] Cluster SE ratio appears reasonable"
.         local ++n_pass
.     }
. }

. else {
.     di as error "  [FAIL] Cluster command failed"
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * TEST 5: Large Violation Rejection
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 5: Large Violation Should Be Rejected"
TEST 5: Large Violation Should Be Rejected

. di as text "=============================================================="
==============================================================

. 
. clear

. set seed 77777

. set obs 500
Number of observations (_N) was 0, now 500.

. gen id = ceil(_n / 5)

. bysort id: gen t = _n

. gen D = (id <= 50)

. 
. gen Y = 10 + rnormal(0, 0.5)

. forvalues s = 2/5 {
  2.     replace Y = Y + 0.8 if D == 1 & t >= `s'
  3. }
(200 real changes made)
(150 real changes made)
(100 real changes made)
(50 real changes made)

. replace Y = Y + 2 if D == 1 & t >= 4
(100 real changes made)

. 
. xtset id t

Panel variable: id (strongly balanced)
 Time variable: t, 1 to 5
         Delta: 1 unit

. 
. local ++n_tests

. di as text "Testing with large pre-treatment violation (S_pre should be ~0.8)
> ..."
Testing with large pre-treatment violation (S_pre should be ~0.8)...

. di as text "Using threshold M = 0.3 (should reject)..."
Using threshold M = 0.3 (should reject)...

. 
. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.3) 
> nograph

Data Validation Summary:
  Total observations:              500
  Valid observations:              500
  Treated observations:            250
  Control observations:            250
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 5
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 2
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.300       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      5           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):2
   Sample size (n):        500

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.6466
   Kappa (κ):              1.581
   Critical value f(α,Σ̂): 10.472

   Pre-test result:            FAIL (Ŝ_pre > M, extrapolation rejected)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.495
   Conditional CI:         [Not available - pre-test failed]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [0.360, 0.630]  (assuming parallel trends)

. 
. if _rc == 0 {
.     local S_pre = e(S_pre)
.     local phi = e(phi)
.     local pretest_pass = e(pretest_pass)
.     
.     di as text "  S_pre = " %9.4f `S_pre'
  S_pre =    0.6466
.     di as text "  phi = " `phi'
  phi = 1
.     di as text "  pretest_pass = " `pretest_pass'
  pretest_pass = 0
.     
.     if `pretest_pass' == 0 & `phi' == 1 {
.         di as result "  [PASS] Correctly rejected (S_pre > M)"
  [PASS] Correctly rejected (S_pre > M)
.         local ++n_pass
.     }
.     else {
.         di as error "  [FAIL] Should have rejected but passed"
.         local ++n_fail
.     }
. }

. else {
.     di as error "  [FAIL] Command failed"
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * TEST 6: Perfect Parallel Trends
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 6: Perfect Parallel Trends (S_pre should be ~0)"
TEST 6: Perfect Parallel Trends (S_pre should be ~0)

. di as text "=============================================================="
==============================================================

. 
. clear

. set seed 66666

. set obs 1000
Number of observations (_N) was 0, now 1,000.

. gen id = ceil(_n / 5)

. bysort id: gen t = _n

. gen D = (id <= 100)

. 
. gen Y = 10 + 0.5 * t + 2 * D + rnormal(0, 0.3)

. replace Y = Y + 3 if D == 1 & t >= 4
(200 real changes made)

. 
. xtset id t

Panel variable: id (strongly balanced)
 Time variable: t, 1 to 5
         Delta: 1 unit

. 
. local ++n_tests

. di as text "Testing with perfect parallel trends..."
Testing with perfect parallel trends...

. 
. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.5) 
> nograph

Data Validation Summary:
  Total observations:            1,000
  Valid observations:            1,000
  Treated observations:            500
  Control observations:            500
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 5
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 2
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      5           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):2
   Sample size (n):        1,000

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.0674
   Kappa (κ):              1.581
   Critical value f(α,Σ̂): 6.007

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               -0.018
   Conditional CI (95%):   [-0.314, 0.279]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [-0.078, 0.042]  (assuming parallel trends)

. 
. if _rc == 0 {
.     local S_pre = e(S_pre)
.     local pretest_pass = e(pretest_pass)
.     local delta = e(delta_bar)
.     
.     di as text "  S_pre = " %9.4f `S_pre' " (should be ~0 due to sampling noi
> se)"
  S_pre =    0.0674 (should be ~0 due to sampling noise)
.     di as text "  pretest_pass = " `pretest_pass'
  pretest_pass = 1
.     di as text "  delta_bar = " %9.4f `delta' " (true effect = 3)"
  delta_bar =   -0.0179 (true effect = 3)
.     
.     if `S_pre' < 0.15 & `pretest_pass' == 1 {
.         di as result "  [PASS] S_pre is small and test passed"
  [PASS] S_pre is small and test passed
.         local ++n_pass
.     }
.     else if `S_pre' >= 0.15 {
.         di as error "  [FAIL] S_pre unexpectedly large for parallel trends da
> ta"
.         local ++n_fail
.     }
.     else {
.         di as error "  [FAIL] Unexpected pretest result"
.         local ++n_fail
.     }
.     
.     if abs(`delta' - 3) < 0.5 {
.         di as result "  [PASS] delta_bar is close to true effect (3)"
.     }
.     else {
.         di as text "  [WARNING] delta_bar differs from true effect"
  [WARNING] delta_bar differs from true effect
.     }
. }

. else {
.     di as error "  [FAIL] Command failed"
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * TEST 7: Overall Mode kappa = 1
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 7: Overall Mode - kappa should equal 1"
TEST 7: Overall Mode - kappa should equal 1

. di as text "=============================================================="
==============================================================

. 
. local ++n_tests

. 
. di as text ""


. di as text "Overall mode:"
Overall mode:

. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.5) 
> overall nograph

Data Validation Summary:
  Total observations:            1,000
  Valid observations:            1,000
  Treated observations:            500
  Control observations:            500
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 5
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 2
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Overall
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      5           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):2
   Sample size (n):        1,000

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.0489
   Kappa (κ):              Overall (no κ)
   Critical value f(α,Σ̂): 4.313

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               -0.018
   Conditional CI (95%):   [-0.203, 0.167]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Overall mode: CI = δ̄ ± {Ŝ_pre + f(α,Σ̂)/√n} (no κ)
------------------------------------------------------------------------
   Conventional CI (95%):  [-0.078, 0.042]  (assuming parallel trends)

. if _rc == 0 {
.     local kappa_overall = e(kappa)
.     di as text "  kappa = " %9.6f `kappa_overall'
  kappa =  1.000000
.     
.     if abs(`kappa_overall' - 1) < 0.001 {
.         di as result "  [PASS] Overall mode kappa = 1 as expected"
  [PASS] Overall mode kappa = 1 as expected
.         local ++n_pass
.     }
.     else {
.         di as error "  [FAIL] Overall mode kappa should be 1, got " %9.4f `ka
> ppa_overall'
.         local ++n_fail
.     }
. }

. else {
.     di as error "  [FAIL] Overall mode command failed"
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * TEST 8: Different p values
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST 8: Different p values (monotonicity check)"
TEST 8: Different p values (monotonicity check)

. di as text "=============================================================="
==============================================================

. 
. local ++n_tests

. 
. * Create data with known violations
. clear

. set seed 55555

. set obs 600
Number of observations (_N) was 0, now 600.

. gen id = ceil(_n / 6)

. bysort id: gen t = _n

. gen D = (id <= 50)

. gen Y = 10 + 0.3*t + rnormal(0, 0.3)

. forvalues s = 2/6 {
  2.     replace Y = Y + 0.1 if D == 1 & t >= `s'
  3. }
(250 real changes made)
(200 real changes made)
(150 real changes made)
(100 real changes made)
(50 real changes made)

. replace Y = Y + 2 if D == 1 & t >= 4
(150 real changes made)

. xtset id t

Panel variable: id (strongly balanced)
 Time variable: t, 1 to 6
         Delta: 1 unit

. 
. di as text "Testing S_pre for different p values..."
Testing S_pre for different p values...

. di as text "(S_pre should increase as p increases)"
(S_pre should increase as p increases)

. 
. local S_p1 = .

. local S_p2 = .

. local S_p10 = .

. 
. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.5) 
> p(1) nograph

Data Validation Summary:
  Total observations:              600
  Valid observations:              600
  Treated observations:            300
  Control observations:            300
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 6
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 3
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               1.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      6           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):3
   Sample size (n):        600

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.1152
   Kappa (κ):              3.000
   Critical value f(α,Σ̂): 11.408

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.086
   Conditional CI (95%):   [-0.725, 0.897]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [0.001, 0.171]  (assuming parallel trends)

. if _rc == 0 {
.     local S_p1 = e(S_pre)
.     di as text "  p=1:  S_pre = " %9.4f `S_p1'
  p=1:  S_pre =    0.1152
. }

. 
. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.5) 
> p(2) nograph

Data Validation Summary:
  Total observations:              600
  Valid observations:              600
  Treated observations:            300
  Control observations:            300
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 6
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 3
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               2.0         Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      6           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):3
   Sample size (n):        600

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.1473
   Kappa (κ):              2.160
   Critical value f(α,Σ̂): 9.005

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.086
   Conditional CI (95%):   [-0.600, 0.772]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [0.001, 0.171]  (assuming parallel trends)

. if _rc == 0 {
.     local S_p2 = e(S_pre)
.     di as text "  p=2:  S_pre = " %9.4f `S_p2'
  p=2:  S_pre =    0.1473
. }

. 
. capture noisily pretest Y, treatment(D) time(t) treat_time(4) threshold(0.5) 
> p(10) nograph

Data Validation Summary:
  Total observations:              600
  Valid observations:              600
  Treated observations:            300
  Control observations:            300
Panel data detected: panelvar=id, timevar=t

Time Structure:
  T (total periods)     = 6
  t0 (treatment time)   = 4
  T_pre (pre-treatment) = 3
  T_post (post-treatment) = 3
Warning: Covariance matrix not positive definite (min eigenvalue = 0.0000e+00),
>  applying regularization

------------------------------------------------------------------------
Conditional Extrapolation Pre-Test for Difference-in-Differences
Mikhaeil & Harshaw (2025)
------------------------------------------------------------------------

Model Specification
------------------------------------------------------------------------
   Threshold (M):          0.500       Mode:                   Iterative
   Alpha (α):              0.050       Confidence:              95.0%
   Norm (p):               10.0        Simulations:                5,000

Time Structure
------------------------------------------------------------------------
   Total periods (T):      6           Treat time (t₀):        4
   Pre-treatment (T_pre):  3           Post-treatment (T_post):3
   Sample size (n):        600

Pre-Test Results
------------------------------------------------------------------------
   Severity (Ŝ_pre):       0.1931
   Kappa (κ):              2.019
   Critical value f(α,Σ̂): 9.725

   Pre-test result:            PASS (Ŝ_pre ≤ M, extrapolation acceptable)

Treatment Effect Estimates
------------------------------------------------------------------------
   ATT (δ̄):               0.086
   Conditional CI (95%):   [-0.701, 0.873]

------------------------------------------------------------------------
Note: φ = 1{Ŝ_pre > M}; PASS means φ=0 (extrapolation justified)
      Iterative mode: CI = δ̄ ± {κ·Ŝ_pre + f(α,Σ̂)/√n}
------------------------------------------------------------------------
   Conventional CI (95%):  [0.001, 0.171]  (assuming parallel trends)

. if _rc == 0 {
.     local S_p10 = e(S_pre)
.     di as text "  p=10: S_pre = " %9.4f `S_p10'
  p=10: S_pre =    0.1931
. }

. 
. * Check monotonicity: S_pre(p=1) <= S_pre(p=2) <= S_pre(p=10)
. if `S_p1' <= `S_p2' + 0.001 & `S_p2' <= `S_p10' + 0.001 {
.     di as result "  [PASS] S_pre is monotonic in p"
  [PASS] S_pre is monotonic in p
.     local ++n_pass
. }

. else {
.     di as error "  [FAIL] S_pre is not monotonic in p"
.     local ++n_fail
. }

. 
. *****************************************************************************
> ***
. * Summary
. *****************************************************************************
> ***
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "TEST SUMMARY - ROUND 18"
TEST SUMMARY - ROUND 18

. di as text "=============================================================="
==============================================================

. di as text ""


. di as text "Total tests: " `n_tests'
Total tests: 8

. di as result "  Passed: " `n_pass'
  Passed: 6

. if `n_fail' > 0 {
.     di as error "  Failed: " `n_fail'
  Failed: 2
. }

. else {
.     di as text "  Failed: " `n_fail'
. }

. di as text "  Warnings: " `n_warning'
  Warnings: 0

. di as text ""


. local pass_rate = round(`n_pass' / `n_tests' * 100, 0.1)

. di as text "Pass rate: " %5.1f `pass_rate' "%"
Pass rate:  75.0%

. 
. if `n_fail' > 0 {
.     di as text ""

.     di as error "CONFIRMED BUGS:"
CONFIRMED BUGS:
.     di as error "  - BUG-001: T_post=1 se_delta_bar issue (if failed)"
  - BUG-001: T_post=1 se_delta_bar issue (if failed)
.     di as error "  - BUG-008: Cluster SE abnormally large (if failed)"
  - BUG-008: Cluster SE abnormally large (if failed)
. }

. 
. di as text ""


. di as text "=============================================================="
==============================================================

. di as text "End of Round 18 Quality Assurance Test"
End of Round 18 Quality Assurance Test

. di as text "=============================================================="
==============================================================

. 
. log close
      name:  <unnamed>
       log:  /Users/cxy/Desktop/2026project/pretest/pretest-stata/tests/qa_roun
> d18_real_data.log
  log type:  text
 closed on:  21 Dec 2025, 20:38:38
-------------------------------------------------------------------------------
